# ClosestPointsPairBetweenTwoCurves Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves Class
Members See Also
---
This class captures results of computation of closest points between two generic curves.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public class ClosestPointsPairBetweenTwoCurves : IDisposable
```

Visual Basic
---
```text
Public Class ClosestPointsPairBetweenTwoCurves _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ClosestPointsPairBetweenTwoCurves : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ClosestPointsPairBetweenTwoCurves
# See Also
ClosestPointsPairBetweenTwoCurves Members
Autodesk.Revit.DB Namespace